app/controllers/school_classes_controller.rb

  def create
    # byebug
    @school_class = SchoolClass.new(params.require(:school_class).permit(:title, :room_number))
    @school_class.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Software Engineering"], ["room_number", 10], ["created_at", "2017-08-12 22:17:44.007004"], ["updated_at", "2017-08-12 22:17:44.007004"]]